
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//++Воробьева А.С.____17.04.2026
	//Добавление поля на форму Контактное лицо
	ДобавлениеРеквизитаНаФорму.ДобавлениеРеквизитаНаФорму(ЭтотОбъект, Элементы);
	//--Воробьева А.С.____17.04.2026
	
	//++Воробьева А.С.____21.04.2026
	//Добавление реквизита на форму скидка  и команда "Пересчитать сумму"
	ПолеСкидка = Элементы.Вставить("Скидка",Тип("ПолеФормы"),Элементы.ГруппаШапкаЛево);
	ПолеСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСкидка.ПутьКДанным = "Объект.ДЗ_Скидка";
	ПолеСкидка.Заголовок = "Скидка";
	
	КомандаПересчитатьСумму = Команды.Добавить("ПересчитатьСумму");
	КомандаПересчитатьСумму.Заголовок = "Пересчитать сумму со скидкой";
	КомандаПересчитатьСумму.Действие = "ПересчитатьСумму";
	
	КнопкаПересчитатьСумму = Элементы.Добавить("КнопкаПересчитатьСумму",Тип("КнопкаФормы"),Элементы.ГруппаШапкаЛево);
	КнопкаПересчитатьСумму.ИмяКоманды = "ПересчитатьСумму";
	КнопкаПересчитатьСумму.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	//--Воробьева А.С.____21.04.2026 
	
	
	//++Воробьева А.С.____21.04.2026
	//создание обработчика ПриИзмененииСкидки
	Элементы.Скидка.УстановитьДействие("ПриИзменении", "ДЗ_СкидкаПриИзменении");
	//--Воробьева А.С.____21.04.2026
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДЗ_СкидкаПриИзменении(Элемент)
	//++Воробьева А.С.____21.04.2026
	//При изменении скидки появляется окно о пересчете скидки
	ВопросОПересчете();
	//--Воробьева А.С.____21.04.2026
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//++Воробьева А.С.____21.04.2026
	//Пересчет суммы с учетом скидки по команде
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество*(1-Объект.ДЗ_Скидка/100) * (1-ТекущиеДанные.Скидка/100);
	
	РассчитатьСуммуДокумента();
	//--Воробьева А.С.____21.04.2026

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВопросОПересчете()
	//++Воробьева А.С.____21.04.2026
	//Пересчет суммы с учетом скидки по команде
	
	Если Объект.Товары.Количество() > 0 Или Объект.Услуги.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Ждать ВопросАсинх("Согласованная скидка изменена. Пересчитать суммы в табличной части?", Режим,,);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			ДЗ_ПересчитатьТаблицы();
		КонецЕсли;
		
	КонецЕсли;	
	//--Воробьева А.С.____21.04.2026
КонецПроцедуры


#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму(Команда)
	
	//++Воробьева А.С.____28.02.2026
	//Пересчет суммы с учетом скидки по команде
	ДЗ_ПересчитатьТаблицы();
	//--Воробьева А.С.____28.02.2026
	
КонецПроцедуры

&НаКлиенте
Процедура ДЗ_ПересчитатьТаблицы()
	//++Воробьева А.С.____28.02.2026
	//Пересчет суммы с учетом скидки по команде
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		РассчитатьСуммуСтроки(СтрокаТЧ);
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из Объект.Услуги Цикл
		РассчитатьСуммуСтроки(СтрокаТЧ);
	КонецЦикла;
	//--Воробьева А.С.____28.02.2026
КонецПроцедуры 

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
