#Область ПрограммныйИнтерфейс

Процедура ДобавлениеРеквизитаНаФорму(Форма, Элементы) Экспорт
	
	//++Воробьева А.С.____28.02.2026
	//Добавление поля на форму 
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" ИЛИ 
		Форма.ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" ИЛИ
		Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда     
		ЭлементКЛ = Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),Элементы.ГруппаШапкаПраво);
		ЭлементКЛ.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементКЛ.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
		ЭлементКЛ.Заголовок = "Контактное лицо";
	
	Иначе
		ЭлементКЛ = Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),,Элементы.СуммаДокумента);
		ЭлементКЛ.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементКЛ.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
		ЭлементКЛ.Заголовок = "Контактное лицо";
	КонецЕсли;
	//--Воробьева А.С.____28.02.2026
	
КонецПроцедуры
#КонецОбласти
